app/Controllers/AdminController.php

    public function User()
    {
        $authModel = new AuthModel();
        $data['users'] = $authModel->findAll();
---
SELECT *
FROM `users`