app/Controllers/CostumerController.php

SELECT *
FROM `shops`
SELECT *
FROM `products`
WHERE `status` = 'active'
SELECT *
FROM `categories`
WHERE `status` = 'active'
---
    public function index()
    {
        $data['shops'] = $this->shopModel->findAll();
        $data['products'] = $this->productModel->where('status', 'active')->findAll();
        $data['categories'] = $this->categoryModel->where('status', 'active')->findAll();