app/Controllers/ProductController.php

    public function kategori($id)
    {
        $data['shops'] = $this->shopModel->findAll();

        $category = $this->categoryModel->find($id);

        $data['products'] = $this->productModel
            ->where('category_id', $id)
            ->where('status', 'active')
            ->findAll();

        $data['categories'] = $this->categoryModel
            ->where('status', 'active')
            ->findAll();
---
SELECT *
FROM `shops`
SELECT *
FROM `categories`
WHERE `categories`.`category_id` = '1'
SELECT *
FROM `products`
WHERE `category_id` = '1'
AND `status` = 'active'
SELECT *
FROM `categories`
WHERE `status` = 'active'